---
kind: property
id: P:Autodesk.Revit.DB.Family.ShowSpatialElementCalculationPoint
zh: 族
source: html/aa96a732-8680-f9b3-58d3-4b4ea05633f2.htm
---
# Autodesk.Revit.DB.Family.ShowSpatialElementCalculationPoint Property

**中文**: 族

For families that can have a calculation point for spatial elements,
hide or show the calculation point.
 SpatialElementCalculationPoint elements.

## Syntax (C#)
```csharp
public bool ShowSpatialElementCalculationPoint { get; set; }
```